/**
最近红薯地入住了一位新的邻居“领航薯”，作为一个一站式咨询AI薯，马上收到了同学们的大量关注，大家最爱和ta交流职场、生活的各种问题，
你作为经常和领航薯交流的同学，你时不时会给ta发送一些信息，偶尔也会从最后一条消息开始撤回逗ta，形式化的，我们可以这样定义：
* 使用 push x 代表你将一条消息发送给了领航薯，我们定义消息的内容为一个正整数 x ；
* 使用 pop 代表你撤回了最后一条消息；
* 领航薯会把你所发送的数字按发送顺序依次连接起来，得到一个数字字符串，请问整个过程一共产生了多少个不同的数字字符串（空串不参与统计）~

输入描述

\hspace{15pt}第一行输入一个整数 n(1≤n≤105)n \left(1\leq n\leq 10^5 \right)n(1≤n≤105) 代表你的操作次数。\hspace{15pt}随后 nnn 行，每行首先输入一个字符串 s (s∈push, pop)s\ (s \in \textsf{push, pop})s (s∈push, pop) 代表这一个操作的类别，随后：∙ \hspace{22.5pt}\bullet\ ∙ 如果 s=pushs = {\sf push}s=push，在同一行上输入一个整数 x(1≤x≤102 000 000)x \left( 1\leq x\leq 10^{2\,000\,000}\right)x(1≤x≤102000000) 代表你发送了整数 xxx ，数字可能会有相同；∙ \hspace{22.5pt}\bullet\ ∙ 如果 s=pops = {\sf pop}s=pop，代表撤回最后一条私信信息；特别的，如果没有最后一条消息，则无视这一次操作。\hspace{15pt}除此之外，保证全部的整数 xxx 之和不超过 102 000 00010 ^ {2\,000\,000}102000000 。

输出描述
\hspace{15pt}在一行上输出一个整数，代表整个过程中产生的不同数字字符串的数量。

示例1

  6
  push 11
  push 4
  push 51
  pop
  pop
  push 45

输出 4
说明:  \,\,\,\,\,\,\,\,\,对于这一个样例，数字字符串 ttt 的变化过程如下：              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=11‾t = \tt \underline{11}t=11​ ；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=114‾t = \tt 11\underline{4}t=114​ ；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=11451‾t = \tt 114\underline{51}t=11451​ ；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙撤回最后发送的数字，t=114t=\tt 114t=114；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙撤回最后发送的数字，t=11t=\tt 11t=11；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=1145‾t = \tt 11\underline{45}t=1145​ ；         \,\,\,\,\,\,\,\,\,一共可以得到四个不同的数字字符串：11,114,11451,1445\tt 11,114,11451,144511,114,11451,1445 。
                                    
                                

示例2

  4
  push 666
  pop
  push 666
  pop

输出：1
说明:   \,\,\,\,\,\,\,\,\,对于这一个样例，数字字符串 ttt 的变化过程如下：              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=666‾t = \tt \underline{666}t=666​ ；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙撤回最后发送的数字，t=NULLt=\tt NULLt=NULL；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙发送一个数字， t=666‾t = \tt \underline{666}t=666​ ；              ∙ \,\,\,\,\,\,\,\,\,\,\,\,\,\,\bullet\,∙撤回最后发送的数字，t=NULLt=\tt NULLt=NULL；         \,\,\,\,\,\,\,\,\,一共可以得到一个不同的数字字符串：666\tt 666666 。注意，空（NULL\tt NULLNULL）字符串不参与计算。
                                    


* 
* 
*/